irrelated_knob_test/sysbench_run_1713063337.out
sysbench 1.1.0-2ca9e3f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 30
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 30 tps: 21.95 qps: 951.72 (r/w/o: 726.26/151.64/73.82) lat (ms,95%): 877.61 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 30 tps: 80.04 qps: 1390.65 (r/w/o: 952.45/278.13/160.08) lat (ms,95%): 1129.24 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 30 tps: 15.00 qps: 264.00 (r/w/o: 189.00/45.00/30.00) lat (ms,95%): 1170.65 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 30 tps: 5.00 qps: 254.00 (r/w/o: 195.00/49.00/10.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 30 tps: 25.00 qps: 360.00 (r/w/o: 226.00/84.00/50.00) lat (ms,95%): 3208.88 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 30 tps: 3.00 qps: 240.00 (r/w/o: 230.00/4.00/6.00) lat (ms,95%): 3040.14 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 30 tps: 35.00 qps: 518.01 (r/w/o: 297.00/151.00/70.00) lat (ms,95%): 2880.27 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 30 tps: 17.00 qps: 417.00 (r/w/o: 293.00/90.00/34.00) lat (ms,95%): 3095.38 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 30 tps: 14.00 qps: 375.00 (r/w/o: 330.00/17.00/28.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 30 tps: 0.00 qps: 4.00 (r/w/o: 4.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 30 tps: 31.00 qps: 623.01 (r/w/o: 404.01/157.00/62.00) lat (ms,95%): 3095.38 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 30 tps: 28.00 qps: 551.00 (r/w/o: 422.00/73.00/56.00) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 30 tps: 0.00 qps: 0.00 (r/w/o: 0.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 30 tps: 0.00 qps: 0.00 (r/w/o: 0.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 30 tps: 31.00 qps: 655.98 (r/w/o: 433.98/159.99/62.00) lat (ms,95%): 3095.38 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 30 tps: 28.00 qps: 356.01 (r/w/o: 193.01/107.00/56.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 30 tps: 9.00 qps: 293.00 (r/w/o: 263.00/12.00/18.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 30 tps: 25.00 qps: 493.97 (r/w/o: 306.98/136.99/50.00) lat (ms,95%): 2585.31 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 30 tps: 12.00 qps: 217.01 (r/w/o: 177.01/16.00/24.00) lat (ms,95%): 2585.31 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 30 tps: 8.00 qps: 164.00 (r/w/o: 98.00/50.00/16.00) lat (ms,95%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 30 tps: 25.00 qps: 437.99 (r/w/o: 287.00/101.00/50.00) lat (ms,95%): 2585.31 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 30 tps: 32.00 qps: 640.01 (r/w/o: 455.00/121.00/64.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 30 tps: 9.00 qps: 275.00 (r/w/o: 226.00/31.00/18.00) lat (ms,95%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 30 tps: 28.00 qps: 432.99 (r/w/o: 267.99/109.00/56.00) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 30 tps: 9.00 qps: 346.01 (r/w/o: 267.01/61.00/18.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 30 tps: 30.00 qps: 470.00 (r/w/o: 314.00/96.00/60.00) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 30 tps: 9.00 qps: 300.00 (r/w/o: 223.00/59.00/18.00) lat (ms,95%): 2828.87 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 30 tps: 27.00 qps: 377.00 (r/w/o: 248.00/75.00/54.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 30 tps: 17.00 qps: 438.99 (r/w/o: 300.99/104.00/34.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 30 tps: 18.00 qps: 334.99 (r/w/o: 257.00/42.00/36.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 30 tps: 18.00 qps: 347.00 (r/w/o: 227.00/84.00/36.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 30 tps: 21.00 qps: 394.01 (r/w/o: 287.01/65.00/42.00) lat (ms,95%): 2493.86 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 30 tps: 15.00 qps: 415.00 (r/w/o: 277.00/108.00/30.00) lat (ms,95%): 2405.65 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 30 tps: 24.00 qps: 372.99 (r/w/o: 267.99/57.00/48.00) lat (ms,95%): 2632.28 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 30 tps: 22.00 qps: 463.01 (r/w/o: 317.01/102.00/44.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 30 tps: 13.00 qps: 319.99 (r/w/o: 249.99/44.00/26.00) lat (ms,95%): 2539.17 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 30 tps: 31.00 qps: 385.00 (r/w/o: 208.00/115.00/62.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 30 tps: 4.00 qps: 355.00 (r/w/o: 316.00/31.00/8.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 30 tps: 29.00 qps: 491.01 (r/w/o: 318.01/115.00/58.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 30 tps: 14.00 qps: 368.99 (r/w/o: 267.99/73.00/28.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 30 tps: 23.00 qps: 334.00 (r/w/o: 217.00/71.00/46.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 30 tps: 11.00 qps: 430.00 (r/w/o: 307.00/101.00/22.00) lat (ms,95%): 2539.17 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 30 tps: 29.00 qps: 396.00 (r/w/o: 295.00/43.00/58.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 30 tps: 26.00 qps: 537.00 (r/w/o: 360.00/125.00/52.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 30 tps: 21.00 qps: 435.00 (r/w/o: 300.00/93.00/42.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 30 tps: 21.00 qps: 505.01 (r/w/o: 374.01/89.00/42.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 30 tps: 31.00 qps: 509.98 (r/w/o: 341.99/106.00/62.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 30 tps: 15.00 qps: 433.00 (r/w/o: 304.00/99.00/30.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 30 tps: 28.00 qps: 418.00 (r/w/o: 294.00/68.00/56.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 30 tps: 28.00 qps: 521.03 (r/w/o: 366.02/99.01/56.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 30 tps: 22.00 qps: 431.99 (r/w/o: 286.99/101.00/44.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 30 tps: 20.00 qps: 478.00 (r/w/o: 353.00/85.00/40.00) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 30 tps: 21.00 qps: 385.00 (r/w/o: 247.00/96.00/42.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 30 tps: 23.00 qps: 486.00 (r/w/o: 358.00/82.00/46.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 30 tps: 28.00 qps: 512.00 (r/w/o: 359.00/97.00/56.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 30 tps: 24.00 qps: 535.01 (r/w/o: 362.00/125.00/48.00) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 30 tps: 18.00 qps: 408.99 (r/w/o: 302.00/71.00/36.00) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 30 tps: 31.00 qps: 572.01 (r/w/o: 410.00/100.00/62.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 30 tps: 12.00 qps: 370.00 (r/w/o: 232.00/114.00/24.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 30 tps: 27.00 qps: 414.99 (r/w/o: 315.99/45.00/54.00) lat (ms,95%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 30 tps: 26.00 qps: 466.00 (r/w/o: 307.00/107.00/52.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 30 tps: 19.00 qps: 430.01 (r/w/o: 289.01/103.00/38.00) lat (ms,95%): 2585.31 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 30 tps: 23.00 qps: 485.98 (r/w/o: 360.99/79.00/46.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 30 tps: 19.00 qps: 353.00 (r/w/o: 250.00/65.00/38.00) lat (ms,95%): 2279.14 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 30 tps: 20.00 qps: 443.01 (r/w/o: 310.01/93.00/40.00) lat (ms,95%): 2449.36 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 30 tps: 23.00 qps: 428.00 (r/w/o: 299.00/83.00/46.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 30 tps: 28.00 qps: 505.00 (r/w/o: 343.00/106.00/56.00) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 30 tps: 20.00 qps: 463.00 (r/w/o: 331.00/92.00/40.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 30 tps: 22.00 qps: 480.00 (r/w/o: 345.00/91.00/44.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 30 tps: 25.00 qps: 410.99 (r/w/o: 275.00/86.00/50.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 30 tps: 20.00 qps: 465.01 (r/w/o: 320.01/105.00/40.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 30 tps: 28.00 qps: 516.99 (r/w/o: 369.99/91.00/56.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 30 tps: 22.00 qps: 473.01 (r/w/o: 339.01/90.00/44.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 30 tps: 23.00 qps: 417.00 (r/w/o: 268.00/103.00/46.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 30 tps: 17.00 qps: 412.99 (r/w/o: 306.99/72.00/34.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 30 tps: 23.00 qps: 408.00 (r/w/o: 293.00/69.00/46.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 30 tps: 22.00 qps: 404.00 (r/w/o: 265.00/95.00/44.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 30 tps: 20.00 qps: 483.02 (r/w/o: 345.01/98.00/40.00) lat (ms,95%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 30 tps: 32.00 qps: 516.00 (r/w/o: 352.00/100.00/64.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 30 tps: 14.00 qps: 443.00 (r/w/o: 325.00/90.00/28.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 30 tps: 23.00 qps: 408.00 (r/w/o: 288.00/74.00/46.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 30 tps: 24.00 qps: 392.99 (r/w/o: 257.99/87.00/48.00) lat (ms,95%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 30 tps: 28.00 qps: 432.00 (r/w/o: 277.00/99.00/56.00) lat (ms,95%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 30 tps: 12.00 qps: 472.00 (r/w/o: 380.00/68.00/24.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 30 tps: 30.00 qps: 510.02 (r/w/o: 346.01/104.00/60.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 30 tps: 19.00 qps: 397.99 (r/w/o: 270.00/90.00/38.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 30 tps: 30.00 qps: 556.01 (r/w/o: 400.01/96.00/60.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 30 tps: 30.00 qps: 597.00 (r/w/o: 413.00/124.00/60.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 30 tps: 20.00 qps: 463.99 (r/w/o: 321.99/102.00/40.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 30 tps: 21.00 qps: 500.01 (r/w/o: 361.01/97.00/42.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 30 tps: 33.00 qps: 534.99 (r/w/o: 352.99/116.00/66.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 30 tps: 15.00 qps: 512.01 (r/w/o: 368.01/114.00/30.00) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 30 tps: 30.00 qps: 353.99 (r/w/o: 251.99/42.00/60.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 30 tps: 18.00 qps: 446.00 (r/w/o: 303.00/107.00/36.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 30 tps: 18.00 qps: 412.00 (r/w/o: 291.00/85.00/36.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 30 tps: 21.00 qps: 433.00 (r/w/o: 312.00/79.00/42.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 30 tps: 26.00 qps: 361.01 (r/w/o: 240.01/69.00/52.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 30 tps: 27.00 qps: 533.01 (r/w/o: 362.00/117.00/54.00) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 30 tps: 11.00 qps: 401.00 (r/w/o: 307.00/72.00/22.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 30 tps: 29.00 qps: 509.00 (r/w/o: 358.00/93.00/58.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 30 tps: 24.00 qps: 480.00 (r/w/o: 331.00/101.00/48.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 30 tps: 31.00 qps: 508.99 (r/w/o: 337.99/109.00/62.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 30 tps: 9.00 qps: 442.00 (r/w/o: 317.00/107.00/18.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 104s ] thds: 30 tps: 34.00 qps: 467.02 (r/w/o: 335.01/64.00/68.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 30 tps: 18.00 qps: 490.00 (r/w/o: 350.00/104.00/36.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 30 tps: 27.00 qps: 490.00 (r/w/o: 342.00/94.00/54.00) lat (ms,95%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 107s ] thds: 30 tps: 18.00 qps: 372.98 (r/w/o: 246.99/90.00/36.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 30 tps: 26.00 qps: 404.01 (r/w/o: 285.00/67.00/52.00) lat (ms,95%): 2449.36 err/s: 0.00 reconn/s: 0.00
[ 109s ] thds: 30 tps: 18.00 qps: 526.02 (r/w/o: 359.01/131.00/36.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 30 tps: 25.00 qps: 481.98 (r/w/o: 352.99/79.00/50.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 30 tps: 29.00 qps: 501.01 (r/w/o: 343.01/100.00/58.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 30 tps: 22.00 qps: 502.99 (r/w/o: 364.99/94.00/44.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 30 tps: 30.00 qps: 495.99 (r/w/o: 348.00/88.00/60.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 30 tps: 31.00 qps: 574.02 (r/w/o: 390.02/122.00/62.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 30 tps: 20.00 qps: 454.98 (r/w/o: 308.99/106.00/40.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 30 tps: 24.00 qps: 497.02 (r/w/o: 343.01/106.00/48.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 30 tps: 32.00 qps: 600.00 (r/w/o: 442.00/94.00/64.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 118s ] thds: 30 tps: 16.00 qps: 428.98 (r/w/o: 276.99/120.00/32.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 119s ] thds: 30 tps: 27.00 qps: 545.02 (r/w/o: 414.02/77.00/54.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 30 tps: 30.00 qps: 528.00 (r/w/o: 364.00/104.00/60.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 121s ] thds: 30 tps: 31.00 qps: 584.98 (r/w/o: 403.99/119.00/62.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 122s ] thds: 30 tps: 17.00 qps: 357.01 (r/w/o: 253.00/70.00/34.00) lat (ms,95%): 1561.52 err/s: 0.00 reconn/s: 0.00
[ 123s ] thds: 30 tps: 26.00 qps: 542.99 (r/w/o: 374.99/116.00/52.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 124s ] thds: 30 tps: 29.00 qps: 578.01 (r/w/o: 413.01/107.00/58.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 30 tps: 23.00 qps: 510.00 (r/w/o: 357.00/107.00/46.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 126s ] thds: 30 tps: 27.00 qps: 490.00 (r/w/o: 349.00/87.00/54.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 127s ] thds: 30 tps: 30.00 qps: 654.00 (r/w/o: 461.00/133.00/60.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 128s ] thds: 30 tps: 22.00 qps: 394.99 (r/w/o: 234.99/116.00/44.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 129s ] thds: 30 tps: 28.00 qps: 500.01 (r/w/o: 376.01/68.00/56.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 30 tps: 26.00 qps: 516.99 (r/w/o: 362.00/103.00/52.00) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 131s ] thds: 30 tps: 20.00 qps: 550.00 (r/w/o: 399.00/111.00/40.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 132s ] thds: 30 tps: 23.00 qps: 391.99 (r/w/o: 256.00/90.00/46.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 133s ] thds: 30 tps: 25.00 qps: 552.00 (r/w/o: 400.00/102.00/50.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 134s ] thds: 30 tps: 24.00 qps: 454.01 (r/w/o: 316.01/90.00/48.00) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 30 tps: 24.00 qps: 463.99 (r/w/o: 319.99/96.00/48.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 136s ] thds: 30 tps: 26.00 qps: 482.00 (r/w/o: 335.00/95.00/52.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 137s ] thds: 30 tps: 17.00 qps: 494.02 (r/w/o: 338.01/122.00/34.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 138s ] thds: 30 tps: 26.00 qps: 482.00 (r/w/o: 357.00/73.00/52.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 139s ] thds: 30 tps: 31.00 qps: 515.98 (r/w/o: 340.99/113.00/62.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 30 tps: 19.00 qps: 397.00 (r/w/o: 278.00/81.00/38.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 141s ] thds: 30 tps: 30.00 qps: 532.00 (r/w/o: 375.00/97.00/60.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 142s ] thds: 30 tps: 26.00 qps: 546.02 (r/w/o: 380.01/114.00/52.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 143s ] thds: 30 tps: 17.00 qps: 355.00 (r/w/o: 252.00/69.00/34.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 144s ] thds: 30 tps: 25.00 qps: 512.99 (r/w/o: 367.99/95.00/50.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 145s ] thds: 30 tps: 21.00 qps: 443.01 (r/w/o: 300.01/101.00/42.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 146s ] thds: 30 tps: 25.00 qps: 495.99 (r/w/o: 346.00/100.00/50.00) lat (ms,95%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 147s ] thds: 30 tps: 26.00 qps: 499.00 (r/w/o: 360.00/87.00/52.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 148s ] thds: 30 tps: 16.00 qps: 388.99 (r/w/o: 252.99/104.00/32.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 149s ] thds: 30 tps: 28.00 qps: 496.02 (r/w/o: 373.01/67.00/56.00) lat (ms,95%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 30 tps: 23.00 qps: 460.99 (r/w/o: 299.99/115.00/46.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 151s ] thds: 30 tps: 25.00 qps: 442.01 (r/w/o: 308.01/84.00/50.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 152s ] thds: 30 tps: 22.00 qps: 469.00 (r/w/o: 324.00/101.00/44.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 153s ] thds: 30 tps: 16.00 qps: 409.00 (r/w/o: 295.00/82.00/32.00) lat (ms,95%): 2493.86 err/s: 0.00 reconn/s: 0.00
[ 154s ] thds: 30 tps: 29.00 qps: 545.00 (r/w/o: 413.00/74.00/58.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 155s ] thds: 30 tps: 23.00 qps: 491.00 (r/w/o: 307.00/138.00/46.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 156s ] thds: 30 tps: 20.00 qps: 465.98 (r/w/o: 339.99/86.00/40.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 157s ] thds: 30 tps: 28.00 qps: 494.02 (r/w/o: 333.01/105.00/56.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 158s ] thds: 30 tps: 38.00 qps: 629.98 (r/w/o: 440.99/113.00/76.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 159s ] thds: 30 tps: 15.00 qps: 409.01 (r/w/o: 307.01/72.00/30.00) lat (ms,95%): 1561.52 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 30 tps: 29.00 qps: 535.98 (r/w/o: 371.99/106.00/58.00) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 161s ] thds: 30 tps: 27.00 qps: 548.01 (r/w/o: 388.01/106.00/54.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 162s ] thds: 30 tps: 29.00 qps: 542.00 (r/w/o: 368.00/116.00/58.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 163s ] thds: 30 tps: 24.00 qps: 502.99 (r/w/o: 359.99/95.00/48.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 164s ] thds: 30 tps: 28.00 qps: 539.00 (r/w/o: 340.00/143.00/56.00) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 165s ] thds: 30 tps: 25.00 qps: 529.99 (r/w/o: 397.00/83.00/50.00) lat (ms,95%): 1938.16 err/s: 0.00 reconn/s: 0.00
[ 166s ] thds: 30 tps: 27.00 qps: 616.01 (r/w/o: 454.00/108.00/54.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 167s ] thds: 30 tps: 32.00 qps: 592.99 (r/w/o: 412.99/116.00/64.00) lat (ms,95%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 168s ] thds: 30 tps: 24.00 qps: 560.02 (r/w/o: 378.02/134.01/48.00) lat (ms,95%): 1427.08 err/s: 0.00 reconn/s: 0.00
[ 169s ] thds: 30 tps: 28.00 qps: 512.98 (r/w/o: 366.99/90.00/56.00) lat (ms,95%): 1561.52 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 30 tps: 31.00 qps: 537.99 (r/w/o: 374.99/101.00/62.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 171s ] thds: 30 tps: 28.00 qps: 503.00 (r/w/o: 340.00/107.00/56.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 172s ] thds: 30 tps: 25.00 qps: 600.00 (r/w/o: 452.00/98.00/50.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 173s ] thds: 30 tps: 8.00 qps: 184.01 (r/w/o: 139.00/29.00/16.00) lat (ms,95%): 2405.65 err/s: 0.00 reconn/s: 0.00
[ 174s ] thds: 30 tps: 20.00 qps: 350.99 (r/w/o: 205.99/105.00/40.00) lat (ms,95%): 2728.81 err/s: 0.00 reconn/s: 0.00
[ 175s ] thds: 30 tps: 12.00 qps: 341.01 (r/w/o: 287.01/30.00/24.00) lat (ms,95%): 2632.28 err/s: 0.00 reconn/s: 0.00
[ 176s ] thds: 30 tps: 0.00 qps: 0.00 (r/w/o: 0.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 177s ] thds: 30 tps: 0.00 qps: 0.00 (r/w/o: 0.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 178s ] thds: 30 tps: 25.00 qps: 439.01 (r/w/o: 299.01/90.00/50.00) lat (ms,95%): 4055.23 err/s: 0.00 reconn/s: 0.00
[ 179s ] thds: 30 tps: 10.00 qps: 223.00 (r/w/o: 93.00/110.00/20.00) lat (ms,95%): 5217.92 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 30 tps: 31.00 qps: 579.00 (r/w/o: 428.00/89.00/62.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 181s ] thds: 30 tps: 13.00 qps: 309.99 (r/w/o: 264.99/19.00/26.00) lat (ms,95%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 182s ] thds: 30 tps: 28.00 qps: 297.01 (r/w/o: 126.00/115.00/56.00) lat (ms,95%): 2828.87 err/s: 0.00 reconn/s: 0.00
[ 183s ] thds: 30 tps: 3.00 qps: 309.99 (r/w/o: 289.99/14.00/6.00) lat (ms,95%): 2493.86 err/s: 0.00 reconn/s: 0.00
[ 184s ] thds: 30 tps: 29.00 qps: 606.02 (r/w/o: 439.01/109.00/58.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 185s ] thds: 30 tps: 0.00 qps: 6.00 (r/w/o: 6.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 186s ] thds: 30 tps: 29.00 qps: 555.02 (r/w/o: 378.01/119.00/58.00) lat (ms,95%): 3448.53 err/s: 0.00 reconn/s: 0.00
[ 187s ] thds: 30 tps: 18.00 qps: 232.99 (r/w/o: 92.00/105.00/36.00) lat (ms,95%): 3267.19 err/s: 0.00 reconn/s: 0.00
[ 188s ] thds: 30 tps: 32.00 qps: 657.00 (r/w/o: 496.00/97.00/64.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 189s ] thds: 30 tps: 30.00 qps: 459.00 (r/w/o: 283.00/116.00/60.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 30 tps: 3.00 qps: 266.01 (r/w/o: 242.01/18.00/6.00) lat (ms,95%): 2539.17 err/s: 0.00 reconn/s: 0.00
[ 191s ] thds: 30 tps: 35.00 qps: 693.99 (r/w/o: 453.99/170.00/70.00) lat (ms,95%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 192s ] thds: 30 tps: 11.00 qps: 305.00 (r/w/o: 267.00/16.00/22.00) lat (ms,95%): 926.33 err/s: 0.00 reconn/s: 0.00
[ 193s ] thds: 30 tps: 23.00 qps: 448.00 (r/w/o: 322.00/80.00/46.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 194s ] thds: 30 tps: 24.00 qps: 332.99 (r/w/o: 162.00/123.00/48.00) lat (ms,95%): 1109.09 err/s: 0.00 reconn/s: 0.00
[ 195s ] thds: 30 tps: 25.00 qps: 573.00 (r/w/o: 413.00/110.00/50.00) lat (ms,95%): 3040.14 err/s: 0.00 reconn/s: 0.00
[ 196s ] thds: 30 tps: 21.00 qps: 408.99 (r/w/o: 285.99/81.00/42.00) lat (ms,95%): 2405.65 err/s: 0.00 reconn/s: 0.00
[ 197s ] thds: 30 tps: 31.00 qps: 484.01 (r/w/o: 325.01/97.00/62.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 198s ] thds: 30 tps: 7.00 qps: 345.00 (r/w/o: 278.00/53.00/14.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 199s ] thds: 30 tps: 9.00 qps: 216.00 (r/w/o: 174.00/24.00/18.00) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 30 tps: 36.00 qps: 684.00 (r/w/o: 450.00/162.00/72.00) lat (ms,95%): 3040.14 err/s: 0.00 reconn/s: 0.00
[ 201s ] thds: 30 tps: 19.00 qps: 407.00 (r/w/o: 319.00/50.00/38.00) lat (ms,95%): 1069.86 err/s: 0.00 reconn/s: 0.00
[ 202s ] thds: 30 tps: 23.00 qps: 320.00 (r/w/o: 158.00/116.00/46.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 203s ] thds: 30 tps: 20.00 qps: 431.00 (r/w/o: 322.00/69.00/40.00) lat (ms,95%): 2632.28 err/s: 0.00 reconn/s: 0.00
[ 204s ] thds: 30 tps: 22.00 qps: 414.96 (r/w/o: 286.97/83.99/44.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 205s ] thds: 30 tps: 39.00 qps: 760.08 (r/w/o: 547.06/135.01/78.01) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 206s ] thds: 30 tps: 24.00 qps: 559.99 (r/w/o: 386.00/126.00/48.00) lat (ms,95%): 960.30 err/s: 0.00 reconn/s: 0.00
[ 207s ] thds: 30 tps: 21.00 qps: 449.99 (r/w/o: 316.99/91.00/42.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 208s ] thds: 30 tps: 33.00 qps: 646.02 (r/w/o: 484.02/96.00/66.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 209s ] thds: 30 tps: 23.00 qps: 416.00 (r/w/o: 279.00/91.00/46.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 30 tps: 16.00 qps: 258.99 (r/w/o: 116.00/111.00/32.00) lat (ms,95%): 2585.31 err/s: 0.00 reconn/s: 0.00
[ 211s ] thds: 30 tps: 21.00 qps: 549.02 (r/w/o: 425.02/82.00/42.00) lat (ms,95%): 2880.27 err/s: 0.00 reconn/s: 0.00
[ 212s ] thds: 30 tps: 30.00 qps: 528.98 (r/w/o: 370.99/98.00/60.00) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 213s ] thds: 30 tps: 24.00 qps: 456.00 (r/w/o: 327.00/81.00/48.00) lat (ms,95%): 1258.08 err/s: 0.00 reconn/s: 0.00
[ 214s ] thds: 30 tps: 29.00 qps: 546.99 (r/w/o: 369.00/120.00/58.00) lat (ms,95%): 1561.52 err/s: 0.00 reconn/s: 0.00
[ 215s ] thds: 30 tps: 27.00 qps: 635.01 (r/w/o: 472.00/109.00/54.00) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 216s ] thds: 30 tps: 0.00 qps: 69.00 (r/w/o: 69.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 217s ] thds: 30 tps: 7.00 qps: 235.99 (r/w/o: 91.00/131.00/14.00) lat (ms,95%): 2680.11 err/s: 0.00 reconn/s: 0.00
[ 218s ] thds: 30 tps: 40.00 qps: 603.01 (r/w/o: 470.01/53.00/80.00) lat (ms,95%): 3773.42 err/s: 0.00 reconn/s: 0.00
[ 219s ] thds: 30 tps: 31.00 qps: 599.02 (r/w/o: 404.02/133.01/62.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 30 tps: 26.00 qps: 541.97 (r/w/o: 377.98/111.99/52.00) lat (ms,95%): 1376.60 err/s: 0.00 reconn/s: 0.00
[ 221s ] thds: 30 tps: 6.00 qps: 223.01 (r/w/o: 197.01/14.00/12.00) lat (ms,95%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 222s ] thds: 30 tps: 22.00 qps: 249.99 (r/w/o: 122.99/83.00/44.00) lat (ms,95%): 2680.11 err/s: 0.00 reconn/s: 0.00
[ 223s ] thds: 30 tps: 30.00 qps: 612.03 (r/w/o: 435.02/117.01/60.00) lat (ms,95%): 2680.11 err/s: 0.00 reconn/s: 0.00
[ 224s ] thds: 30 tps: 16.00 qps: 531.00 (r/w/o: 366.00/133.00/32.00) lat (ms,95%): 3511.19 err/s: 0.00 reconn/s: 0.00
[ 225s ] thds: 30 tps: 44.00 qps: 703.99 (r/w/o: 499.00/117.00/88.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 226s ] thds: 30 tps: 23.00 qps: 490.98 (r/w/o: 354.99/90.00/46.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 227s ] thds: 30 tps: 0.00 qps: 112.00 (r/w/o: 112.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 228s ] thds: 30 tps: 37.00 qps: 352.00 (r/w/o: 145.00/133.00/74.00) lat (ms,95%): 2880.27 err/s: 0.00 reconn/s: 0.00
[ 229s ] thds: 30 tps: 13.00 qps: 596.02 (r/w/o: 472.01/98.00/26.00) lat (ms,95%): 995.51 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 30 tps: 32.00 qps: 609.98 (r/w/o: 438.99/107.00/64.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 231s ] thds: 30 tps: 28.00 qps: 471.01 (r/w/o: 313.01/102.00/56.00) lat (ms,95%): 1258.08 err/s: 0.00 reconn/s: 0.00
[ 232s ] thds: 30 tps: 8.00 qps: 233.00 (r/w/o: 191.00/26.00/16.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 233s ] thds: 30 tps: 35.00 qps: 665.98 (r/w/o: 452.99/143.00/70.00) lat (ms,95%): 2362.72 err/s: 0.00 reconn/s: 0.00
[ 234s ] thds: 30 tps: 23.00 qps: 572.01 (r/w/o: 404.00/122.00/46.00) lat (ms,95%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 235s ] thds: 30 tps: 8.00 qps: 222.00 (r/w/o: 159.00/47.00/16.00) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 236s ] thds: 30 tps: 36.00 qps: 541.01 (r/w/o: 376.01/93.00/72.00) lat (ms,95%): 2632.28 err/s: 0.00 reconn/s: 0.00
[ 237s ] thds: 30 tps: 20.00 qps: 491.00 (r/w/o: 369.00/82.00/40.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 238s ] thds: 30 tps: 0.00 qps: 39.00 (r/w/o: 39.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 239s ] thds: 30 tps: 40.00 qps: 731.99 (r/w/o: 500.99/151.00/80.00) lat (ms,95%): 3151.62 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 30 tps: 30.00 qps: 446.02 (r/w/o: 260.01/126.01/60.00) lat (ms,95%): 1069.86 err/s: 0.00 reconn/s: 0.00
[ 241s ] thds: 30 tps: 30.00 qps: 702.97 (r/w/o: 490.98/151.99/60.00) lat (ms,95%): 909.80 err/s: 0.00 reconn/s: 0.00
[ 242s ] thds: 30 tps: 17.00 qps: 317.01 (r/w/o: 251.01/32.00/34.00) lat (ms,95%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 243s ] thds: 30 tps: 36.00 qps: 744.01 (r/w/o: 527.01/145.00/72.00) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 244s ] thds: 30 tps: 0.00 qps: 112.00 (r/w/o: 112.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 245s ] thds: 30 tps: 55.00 qps: 981.98 (r/w/o: 654.99/217.00/110.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 246s ] thds: 30 tps: 29.00 qps: 565.00 (r/w/o: 374.00/133.00/58.00) lat (ms,95%): 1327.91 err/s: 0.00 reconn/s: 0.00
[ 247s ] thds: 30 tps: 41.00 qps: 581.03 (r/w/o: 348.02/151.01/82.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
[ 248s ] thds: 30 tps: 13.00 qps: 454.99 (r/w/o: 375.99/53.00/26.00) lat (ms,95%): 1129.24 err/s: 0.00 reconn/s: 0.00
[ 249s ] thds: 30 tps: 1.00 qps: 197.00 (r/w/o: 193.00/2.00/2.00) lat (ms,95%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 30 tps: 31.00 qps: 672.99 (r/w/o: 428.99/182.00/62.00) lat (ms,95%): 2320.55 err/s: 0.00 reconn/s: 0.00
[ 251s ] thds: 30 tps: 49.00 qps: 698.00 (r/w/o: 445.00/155.00/98.00) lat (ms,95%): 1129.24 err/s: 0.00 reconn/s: 0.00
[ 252s ] thds: 30 tps: 27.00 qps: 577.02 (r/w/o: 417.01/106.00/54.00) lat (ms,95%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 253s ] thds: 30 tps: 27.00 qps: 486.00 (r/w/o: 339.00/93.00/54.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 254s ] thds: 30 tps: 32.00 qps: 883.01 (r/w/o: 694.01/125.00/64.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 255s ] thds: 30 tps: 15.00 qps: 336.00 (r/w/o: 183.00/123.00/30.00) lat (ms,95%): 1427.08 err/s: 0.00 reconn/s: 0.00
[ 256s ] thds: 30 tps: 32.00 qps: 563.98 (r/w/o: 397.99/102.00/64.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 257s ] thds: 30 tps: 27.00 qps: 513.02 (r/w/o: 361.01/98.00/54.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 258s ] thds: 30 tps: 29.00 qps: 594.98 (r/w/o: 413.99/123.00/58.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 259s ] thds: 30 tps: 17.00 qps: 325.01 (r/w/o: 219.01/72.00/34.00) lat (ms,95%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 30 tps: 29.00 qps: 621.00 (r/w/o: 439.00/124.00/58.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 261s ] thds: 30 tps: 33.00 qps: 569.99 (r/w/o: 406.99/97.00/66.00) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 262s ] thds: 30 tps: 12.00 qps: 371.00 (r/w/o: 295.00/52.00/24.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 263s ] thds: 30 tps: 31.00 qps: 492.02 (r/w/o: 318.01/112.00/62.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 264s ] thds: 30 tps: 36.00 qps: 673.98 (r/w/o: 451.99/150.00/72.00) lat (ms,95%): 1129.24 err/s: 0.00 reconn/s: 0.00
[ 265s ] thds: 30 tps: 19.00 qps: 472.01 (r/w/o: 331.00/103.00/38.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 266s ] thds: 30 tps: 30.00 qps: 497.01 (r/w/o: 335.01/102.00/60.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 267s ] thds: 30 tps: 29.00 qps: 598.00 (r/w/o: 429.00/111.00/58.00) lat (ms,95%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 268s ] thds: 30 tps: 11.00 qps: 379.99 (r/w/o: 318.99/39.00/22.00) lat (ms,95%): 1771.29 err/s: 0.00 reconn/s: 0.00
[ 269s ] thds: 30 tps: 7.00 qps: 242.00 (r/w/o: 98.00/130.00/14.00) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 30 tps: 35.00 qps: 553.00 (r/w/o: 418.00/65.00/70.00) lat (ms,95%): 2493.86 err/s: 0.00 reconn/s: 0.00
[ 271s ] thds: 30 tps: 46.00 qps: 824.02 (r/w/o: 565.01/167.00/92.00) lat (ms,95%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 272s ] thds: 30 tps: 18.00 qps: 435.99 (r/w/o: 339.99/60.00/36.00) lat (ms,95%): 977.74 err/s: 0.00 reconn/s: 0.00
[ 273s ] thds: 30 tps: 24.00 qps: 443.00 (r/w/o: 297.00/98.00/48.00) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 274s ] thds: 30 tps: 0.00 qps: 102.00 (r/w/o: 102.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 275s ] thds: 30 tps: 45.00 qps: 598.99 (r/w/o: 337.00/172.00/90.00) lat (ms,95%): 3511.19 err/s: 0.00 reconn/s: 0.00
[ 276s ] thds: 30 tps: 13.00 qps: 474.01 (r/w/o: 362.01/86.00/26.00) lat (ms,95%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 277s ] thds: 30 tps: 36.00 qps: 608.99 (r/w/o: 408.99/128.00/72.00) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 278s ] thds: 30 tps: 29.00 qps: 522.00 (r/w/o: 363.00/101.00/58.00) lat (ms,95%): 1903.57 err/s: 0.00 reconn/s: 0.00
[ 279s ] thds: 30 tps: 9.00 qps: 248.00 (r/w/o: 186.00/44.00/18.00) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 30 tps: 31.00 qps: 619.00 (r/w/o: 413.00/144.00/62.00) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 281s ] thds: 30 tps: 20.00 qps: 517.01 (r/w/o: 394.01/83.00/40.00) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 282s ] thds: 30 tps: 40.00 qps: 726.98 (r/w/o: 502.99/144.00/80.00) lat (ms,95%): 1648.20 err/s: 0.00 reconn/s: 0.00
[ 283s ] thds: 30 tps: 29.00 qps: 648.01 (r/w/o: 457.01/133.00/58.00) lat (ms,95%): 1304.21 err/s: 0.00 reconn/s: 0.00
[ 284s ] thds: 30 tps: 34.00 qps: 641.99 (r/w/o: 450.99/123.00/68.00) lat (ms,95%): 1352.03 err/s: 0.00 reconn/s: 0.00
[ 285s ] thds: 30 tps: 4.00 qps: 230.01 (r/w/o: 171.00/51.00/8.00) lat (ms,95%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 286s ] thds: 30 tps: 34.00 qps: 574.97 (r/w/o: 381.98/124.99/68.00) lat (ms,95%): 2082.91 err/s: 0.00 reconn/s: 0.00
[ 287s ] thds: 30 tps: 37.00 qps: 713.02 (r/w/o: 511.01/128.00/74.00) lat (ms,95%): 1235.62 err/s: 0.00 reconn/s: 0.00
[ 288s ] thds: 30 tps: 35.00 qps: 698.01 (r/w/o: 490.00/138.00/70.00) lat (ms,95%): 1235.62 err/s: 0.00 reconn/s: 0.00
[ 289s ] thds: 30 tps: 22.00 qps: 379.99 (r/w/o: 252.99/83.00/44.00) lat (ms,95%): 1533.66 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 30 tps: 22.00 qps: 543.02 (r/w/o: 386.01/113.00/44.00) lat (ms,95%): 2045.74 err/s: 0.00 reconn/s: 0.00
[ 291s ] thds: 30 tps: 32.00 qps: 557.98 (r/w/o: 392.99/101.00/64.00) lat (ms,95%): 1739.68 err/s: 0.00 reconn/s: 0.00
[ 292s ] thds: 30 tps: 15.00 qps: 435.00 (r/w/o: 357.00/48.00/30.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 293s ] thds: 30 tps: 30.00 qps: 476.00 (r/w/o: 281.00/135.00/60.00) lat (ms,95%): 1973.38 err/s: 0.00 reconn/s: 0.00
[ 294s ] thds: 30 tps: 24.00 qps: 487.00 (r/w/o: 340.00/99.00/48.00) lat (ms,95%): 1589.90 err/s: 0.00 reconn/s: 0.00
[ 295s ] thds: 30 tps: 33.00 qps: 671.00 (r/w/o: 475.00/130.00/66.00) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 296s ] thds: 30 tps: 19.00 qps: 470.01 (r/w/o: 375.01/57.00/38.00) lat (ms,95%): 1327.91 err/s: 0.00 reconn/s: 0.00
[ 297s ] thds: 30 tps: 0.00 qps: 13.00 (r/w/o: 13.00/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 298s ] thds: 30 tps: 37.00 qps: 424.02 (r/w/o: 201.01/149.01/74.00) lat (ms,95%): 3095.38 err/s: 0.00 reconn/s: 0.00
[ 299s ] thds: 30 tps: 8.00 qps: 467.00 (r/w/o: 380.00/71.00/16.00) lat (ms,95%): 1280.93 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 30 tps: 41.00 qps: 705.99 (r/w/o: 472.99/151.00/82.00) lat (ms,95%): 1618.78 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            97496
        write:                           27856
        other:                           13928
        total:                           139280
    transactions:                        6964   (23.18 per sec.)
    queries:                             139280 (463.57 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      23.1787
    time elapsed:                        300.4486s
    total number of events:              6964

Latency (ms):
         min:                                   28.20
         avg:                                 1293.36
         max:                                 5225.22
         95th percentile:                     2320.55
         sum:                              9006956.93

Threads fairness:
    events (avg/stddev):           232.1333/4.90
    execution time (avg/stddev):   300.2319/0.12